{
    "Date": "17/05/2022 12:00",
    "Model": "<model.spellcheck_model.DetectorCandidatorRanker object at 0x7fa324fab940>",
    "Metrics": {
        "Precision@1": 0.96,
        "True": 462,
        "False": 18
    },
    "Mistakes examples": {
        "Wrong candidate choosen": [
            [
                "Sentence: Firstly, it will introduce the latest fashions connecting Millenium., Corr word: Millennium., Res word: Millennial."
            ],
            [
                "Sentence: Absolutely it was very dissapointing, Corr word: disappointing, Res word: disappointed"
            ],
            [
                "Sentence: In addition to this, you may have some roboters bringing the newspaper to the table, tidying up the house, and doing the shopping. Maybe they will also be your life patners., Corr word: partners., Res word: partner."
            ],
            [
                "Sentence: I really recomend you to help them, I think this is a good oppotunity and I want you to understand my feeling well., Corr word: recommend, Res word: commend"
            ],
            [
                "Sentence: The band \"Three Kings\" apresented a new stily of music., Corr word: presented, Res word: represent"
            ],
            [
                "Sentence: - Art exbitions to teach us more things about the artist's lifestyle; and, Corr word: exhibitions, Res word: exhibition"
            ],
            [
                "Sentence: In my opinion the worst thing which may happen is an extremly long queu for the changing room., Corr word: extremely, Res word: extreme"
            ],
            [
                "Sentence: It was a very unpleasent evening., Corr word: unpleasant, Res word: pleasant"
            ],
            [
                "Sentence: We shouldn't disregard and neglect to film the buildings and the gardens of our beautiful college, especially if we take into consideration the fact that it is in the city of Shakespear., Corr word: Shakespeare., Res word: Peshawar."
            ],
            [
                "Sentence: I would definitly choose basketball and swimming wich are my dream sports., Corr word: which, Res word: with"
            ]
        ]
    }
}